{
    "projects": [
        {
            "id": "0",
            "name": "GardenGame",
            "description": "A fun and interactive game made for you to sit back and cultivate a peaceful garden.",
            "date": "2023-07-27",
            "videos": ["https://www.youtube.com/watch?v=k33QYJn3hmQ"],
            "images": ["/gardengame.png"],
            "technologies": ["Javascript-Languages", "Flask-Frameworks", "SQL-Data", "Amazon AWS-Tools"],
            "aboutParagraphs": ["This enjoyable game, based on the game Cookie Clicker, puts you in the shoes of a gardener, allowing you to grow and nurture a peaceful garden. As your virtual plants flourish, you'll find yourself returning to monitor their progress and expand your garden.",
                                "One of the most fulfilling elements of this project that I implemented was the game state-saving mechanics. Every interaction with the game, be it hovering/clicking on the game board or making a purchase from the store, triggers an automatic save of the game state. Even if they exit the game or close the page, eliminating any risk of progress loss.",
                                "Additionally, the excitement grew with the leaderboard system, allowing users to track the top gardens based on the most leaves or leaves per second. If I return to this project, I would like to implement a feature that allows users to share their garden to social media, enhancing the social aspect.",
                                "For the development of this project, I used pure Javascript and Jinja2 templates to construct the front end. The backend is powered by a PostgreSQL database, which stores both game data and user information. To handle the game API and serve the front end, I utilized a Flask server."
            ]
        },
        {
            "id": "1",
            "name": "MidiFret",
            "description": "An online file converter that lets users convert .midi files into readable guitar tablature",
            "date": "2023-04-05",
            "videos": ["https://www.youtube.com/watch?v=FArKw2FsZsw"],
            "images": ["/midifret.png"],
            "technologies": ["Javascript-Languages", "Node.js-Frameworks", "Amazon AWS-Tools", "bit.io-Data"],
            "aboutParagraphs": ["Online guitar tablature helped me learn guitar and I wanted to make tabs more available to give new player more tools to learn. I did this by creating a tool for anyone to either compose their own tabs or upload .midi files and convert them into tabs.",
                                "The technology stack is straightforward for this project, utilizing Javascript and HTML for the front end. On the backend, a Node server is responsible for managing the application. Additionally, I integrated an online bit.io database to efficiently store tab data. I also used webpack and MidiParser.js for specific functionalities."
            ]
        },
        {
            "id": "2",
            "name": "ArtistLinq",
            "description": "Create a community around your creativity!",
            "date": "2023-xx-xx",
            "images": ["/artistlinq.png"],
            "technologies": ["Typescript-Languages", "Next.js-Frameworks", "prisma-Data", "Microsoft Azure-Tools"],
            "aboutParagraphs": ["ArtistLinq is a mock social media platform designed to cater to the artistic community. Providing a dynamic space for artists to showcase their creations, sell their artwork, set up a personalized commission shop, and fostering connections with fans and fellow artists. With robust user authentication, ArtistLinq enables artists to engage in meaningful interactions through likes, favorites, and saves."]
        },
        {
            "id": "3",
            "name": "PixelPath",
            "description": "Try to find strategy while you defend your tower against a randomly generated world.",
            "date": "2023-xx-xx",
            "images": ["/pixelpath.png"],
            "technologies": ["C#-Languages", "Unity-Apps", "Blender-Apps"],
            "aboutParagraphs": ["In PixelPath, you face relentless waves of enemies, and your tower stands as the last line of defense. While your defenses can slow them down, the challenge lies in the inevitability that they won't be deterred forever. As you navigate through an unknown map, the challenge unfolds with each wave, adding an element of exploration and unpredictability to the gameplay."]
        },
        {
            "id": "4",
            "name": "SurvivalRTS",
            "description": "Description goes here.",
            "date": "2023-xx-xx",
            "images": [],
            "technologies": ["C#-Languages", "Unity-Apps", "Blender-Apps"],
            "aboutParagraphs": ["SurvivalRTS, a fusion of Command and Conquer and Minecraft, is an innovative game is crafted with a blend of technologies and thoughtful game mechanics. I used Unity, a leading game engine, to provide a seamless environment for creating immersive 3D worlds and fluid gameplay, while the intricate game logic and mechanics are powered by the C# programming language."]
        },
        {
            "id": "5",
            "name": "Fresh Table Greens",
            "description": "Description goes here.",
            "date": "2023-xx-xx",
            "images": [],
            "technologies": ["Typescript-Languages", "Next.js-Frameworks", "Amazon AWS-Tools"],
            "aboutParagraphs": ["I transformed initial mockups into a sleek, user-friendly platform tailored to the client's needs."]
        }
    ]
}